johnR46/BellLab_STM32/V5/ADC+DMA/USER/main.c
/*******************************************************************************
  Function Name  : main
  Description    : Main program
  Input          : None
  Output         : None
  Return         : None
  Attention      : None
*******************************************************************************/
void changeBuatRate() {
  SendCH370(changeBaudRateByte, sizeof(changeBaudRateByte));
  delay_ms(50);
  if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
    i1 = USART_ReceiveData(USART3);
    printf("%c\r\n", i1);
  }
  printf("change 115200\r\n");
}
void prepareSD() {
  int preStatus = 1;
  command_++;
  while (preStatus) {
    if (command_ == 1) {
      SendCH370(checkConnection, sizeof(checkConnection));
      //printf(" check connecttion \r\n");
      command_++; //2
      delay_ms(50);
    } else if (command_ == 2) {
      SendCH370(setSDCard, sizeof(setSDCard));
      //printf(" set sd card\r\n");
      command_++; //4
      delay_ms(50);
    } else if (command_ == 3) {
      SendCH370(USBDiskMount, sizeof(USBDiskMount));
      //printf(" usb disk mount \r\n");
      command_++; //6
      delay_ms(50);
    } else if (command_ == 4) {
      SendCH370(setAllName, sizeof(setAllName));
      //printf(" set all file \r\n");
      delay_ms(50);
      command_++; //10
    } else if (command_ == 5) {
      SendCH370(FileOpen, sizeof(FileOpen));
      //printf(" file open \r\n");
      delay_ms(50);
      command_++; //10
    } else if (command_ == 6) {
      SendCH370(FileClose, sizeof(FileClose));
      //printf(" File Close \r\n");
      delay_ms(50);
      command_++; //10
      preStatus = 0;
    }
    /*if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
        i1 = USART_ReceiveData(USART3);
        printf("%x-%d\r\n", i1, i1);
      }*/
  }
}

void searchFile2(void);
void NextFile(void);
void keyRead(void);
void exitOncePath();
void cdWithPath(char *path);


int maxFile = 0;
int fileSelect = 0;
int checkFileType(char * file);
int openDir(char * dirPath);
int savePath(char *pathName);
int checkSlash(char *pathName);
int countPath(char *pathSource);

char Dirpath[30] = "";
char fileLists[30][15];

int main(void)
{
  /* Configure the GPIO ports */
  GPIO_Configuration();             //if config this can't use printf
  //----------------------------------------------------------------------------------------------------------
  UART4_Configuration(); //9600
  USART2_Configuration(); //115200
  USART1_Configuration(); //115200
  USART3_Configuration(); //9600
  Init_SPI();
  delay_init();
  sendUart(1);

  configDisplay();
  printDot(st_0, sizeof(st_0));
  delay_ms(1200);
  stringToUnicodeAndSendToDisplay("Notepad");
  //****************** check dot****************
  printf("---------------- \r\n");


  command_ = 1;

  //configFlash();
  /* while (1) {
     menu_s();
     while (mode == 1) {
       notepad();
     }
     while (mode == 2 && openFileStatus == 0) {
       searchFile();
     }
     while (mode == 2 && openFileStatus == 1) {
       ReadFile();
     }
     while (mode == 3) {
       GPIO_SetBits(GPIOC , GPIO_Pin_0);
       BluetoothMode();
       // keyboardMode();
       if (becon == 0) {
         menu_s();
       }
       else {
         keyboardMode();
       }
     }
    }*/

  while (1) {
    MessangerASCII();
  }

}

int keyMapping(int a, int b, int c) {
  int keyCode__ =  0;
  if (a == 0x00 && b == 0x00 && c == 0x04) {
    keyCode__ = 37;  // ArrowLeft
  }
  else if (a == 0x00 && b == 0x00 && c == 0x10) {
    keyCode__ = 38; // ArrowUp
  }
  else if (a == 0x00 && b == 0x00 && c == 0x08) {
    keyCode__ = 39; // ArrowRight
  }
  else if (a == 0x00 && b == 0x00 && c == 0x20) {
    keyCode__ = 40; // ArrowDown
  }
  else if (b == 64 || c == 8) {
    keyCode__ = 13; // enter
  }
  return keyCode__;
}
void keyRead() {
  if (USART_GetITStatus(USART2, USART_IT_RXNE)) {
    //----------------------------- uart to key--------------------------------
    uart2Buffer = USART_ReceiveData(USART2);                                //-
    if (uart2Buffer == 0xff && SeeHead == 0) {                              //-
      SeeHead = 1;                                                          //-
      countKey = 0;                                                         //-
    }                                                                       //-
    if (countKey == 2 && uart2Buffer == 0xa4) {
      seeCur = 1;
    }
    if (countKey >= 4 && countKey <= 6) {                                   //-
      bufferKey3digit[countKey - 4] = uart2Buffer;                          //-
    }
    if (countKey == 2) //checkKeyError
    {
      checkKeyError = uart2Buffer;
    }
    countKey++;
    // ---------------------------- end uart to key ----------------------------
    // printf("[%x]\r\n",uart2Buffer);
  }
  if (countKey >= maxData) { //Recieve & checking key
    seeHead = 0;
    printf("See key %x,%x,%x\r\n", bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);
    if (checkKeyError == 0xff) { //clear error key
      countKey = 0;
      SeeHead = 0;
    }

    // key mapping //
    keyCode = keyMapping(bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);
    // end keymapping //

    if (1) { //key in mode 0
      if (count_menu >= 1 && count_menu <= maxMenu && mode == 0) { //select menu //modemenu
        if (keyCode == 40) { //up
          if (count_menu != maxMenu) {
            count_menu++;
          }
        }
        else if (keyCode == 38) { //down
          if (count_menu != 1) {
            count_menu -= 1;
          }
        }
      }
      if (keyCode == 39) {
        if (mode == 0) { //
          previousMode = mode;
          mode = count_menu;
          printf("mode:%d", mode);
        }
      }
      caseMenu(count_menu);
    }
    //--------
    if (mode == 2) { //key in mode 2
      if (keyCode == 38) {
        if (fileSelect > 0) {
          fileSelect--;
        }
      } else if (keyCode == 40) {
        if (fileSelect < maxFile - 1) {
          fileSelect++;
        }
      }
      printf("%s\r\n", fileLists[fileSelect]);
      printf("%s\r\n", Dirpath);
      if (keyCode == 39) { //enter
        printf("Opening %s\r\n", fileLists[fileSelect]);
        printf("type:%d\r\n", checkFileType(fileLists[fileSelect]));
        if (checkFileType(fileLists[fileSelect]) == 0) {
          maxFile = 0;
          if (openDir(fileLists[fileSelect])) {
            if (strstr(fileLists[fileSelect], "..") != NULL) {
              while (countPath(Dirpath) > 0) { //back and clear path
                exitOncePath();
              }
            } else { //save path
              savePath(fileLists[fileSelect]);
            }
            fileSelect = 0;
            printf("seach all file sucess \r\n");
            command_ = 4;
          }
        }
        //command_ = 16;
      }
      if (keyCode == 37) {
        printf("exit\r\n");
        maxFile = 0;
        exitOncePath();
        //openDir("..");
        cdWithPath(Dirpath);
        command_ = 4;
      }
    }
    ///------
    countKey = 0;
    keyCode = 0;
    seeCur = 0;
  }

