johnR46/BellLab_STM32/V5/ADC+DMA/USER/main.c
  memset (bufferDisplay, 0, 20);
  strcpy(bufferDisplay, "Name:/");
  memset(nameBuff, 0, 15);
  nameBuff[0] = '/';
  countKey = 0;
  keyCode = 0;
  seeCur = 0;
  clearDot();
  while (saving == 1) {
    if (USART_GetITStatus(USART2, USART_IT_RXNE)) {
      //----------------------------- uart to key--------------------------------
      uart2Buffer = USART_ReceiveData(USART2);                                //-
      if (uart2Buffer == 0xff && SeeHead == 0) {                              //-
        SeeHead = 1;                                                          //-
        countKey = 0;                                                         //-
      }
      if (countKey == 2 && uart2Buffer == 0xa4) { // if cursor
        seeCur = 1;
      }
      if (countKey >= 4 && countKey <= 6) {                                   //-
        bufferKey3digit[countKey - 4] = uart2Buffer;                          //-
      }

      if (countKey == 2)
      {
        checkKeyError = uart2Buffer;
      }
      countKey++;

      if (countKey >= maxData) {
        seeHead = 0;
        if (checkKeyError == 0xff) { //check error key
          //printf("Key Error");
          countKey = 0;
          SeeHead = 0;
        }
        if ((bufferKey3digit[0] == 0x00 && bufferKey3digit[1] == 0x20 && bufferKey3digit[2] == 0x00) || (bufferKey3digit[0] == 0x00 && bufferKey3digit[1] == 0x00 && bufferKey3digit[2] == 0x04)) { //back to notepad
          saving = 0;

        }
        if (bufferKey3digit[0] == 0x80 && bufferKey3digit[1] == 0 && bufferKey3digit[2] == 0 ) {
          keyCode = 8;
        }
        if (bufferKey3digit[2] == 2 || bufferKey3digit[1] == 0x10) { // save file
          printf("\r\n enter \r\n");
          i = 0;
          while (nameBuff[i] != '\0') {
            if (nameBuff[i] >= 97) {
              nameBuff[i] = nameBuff[i] - 32;
            }
            i++;
          }
          strcat(nameBuff, ".TBT");
          //printf("\r\nSaving file :%s\r\n", nameBuff);
          createFileAndWrite(nameBuff);
          stringToUnicodeAndSendToDisplay("Success......");
          delay_ms(600);
          saving = 0;
        }
        if (keyCode == 8) { // delete file name
          if (cc > 1) { // steel save root /
            cc--;
            nameBuff[cc] = '\0';
            //printf("Delete:%s \r\n", nameBuff);
          } else if (cc == 1) { // last cha
            nameBuff[cc] = '\0';
            //printf("delete 22 \r\n");
          }
        }
        else // enter file name
        {
          // printf("See key %x,%x,%x\r\n", bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);
          for ( i = 0; i < 255; i++) {
            if (bufferKey3digit[0]  == unicodeTable[(char) i]) {
              break;
            }
          }
          if (i >= 33 && i < 126 && cc <= 10) { // name length less than 10
            nameBuff[cc] = i;
            //printf("Filename:%s\r\n", nameBuff);

            cc++;
          }
        }
        memset (bufferDisplay, 0, 20);
        strcpy(bufferDisplay, "Name:");
        strcat(bufferDisplay, nameBuff);
        //stringToUnicodeAndSendToDisplay(bufferDisplay);



        /*-----------------------
          print file name here
          -----------------------*/
        countKey = 0;
        keyCode = 0;
        seeCur = 0;
      }
    }
    d_Time++;
    if (d_Time >= delayCur) { //blink cu
      if (toggleCur == 0)
        toggleCur = 1;
      else
        toggleCur = 0;
      if (!toggleCur)
        stringToUnicodeAndSendToDisplay(bufferDisplay);
      else
        stringToUnicodeAndSendToDisplayC(bufferDisplay, cc + 5);
      d_Time = 0;
    }
  }
}

void MessangerASCII() {
  if (USART_GetITStatus(USART2, USART_IT_RXNE)) {
    //----------------------------- uart to key--------------------------------
    uart2Buffer = USART_ReceiveData(USART2);                                //-
    if (uart2Buffer == 0xff && SeeHead == 0) {                              //-
      SeeHead = 1;                                                          //-
      countKey = 0;                                                         //-
    }
    if (countKey == 2 && uart2Buffer == 0xa4) { // if cursor
      seeCur = 1;
    }
    if (countKey >= 4 && countKey <= 6) {                                   //-
      bufferKey3digit[countKey - 4] = uart2Buffer;                          //-
    }
    if (countKey == 2) //0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
    {
      checkKeyError = uart2Buffer;
    }
    countKey++;
    // ---------------------------- end uart to key ----------------------------
    // printf("[%x]\r\n",uart2Buffer);
  }
  if (countKey >= maxData) { //Recieve & checking key
    seeHead = 0;
    printf("\r\n===================================See key(Hex) %x,%x,%x =====================================\r\n", bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);

    //printf("checkKey :%x\r\n",checkKeyError);
    if (checkKeyError == 0xff) { //check error key
      //printf("Key Error");
      countKey = 0;
      SeeHead = 0;
    }
    if (bufferKey3digit[1] == 3  && bufferKey3digit[0] == 0) { // joy is up
      keyCode = 32;  // arrow up
    }
    if (bufferKey3digit[0] == 0x80 && seeCur != 1) {  // delete char in str2
      keyCode = 80; // delete
    }
    if (bufferKey3digit[0] == 0x40) {  // delete char in str2
      keyCode = 70; // enter
    }
    if (seeCur == 1) {  // selector mapcur
      mapcur =  mapCursor(bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);
      printf("\r\n------------------ mapcursor = %d ----------------------------\r\n ",mapcur);
      if (note.cursor >= 0 && note.cursor <= 20 ) {

        if (mapcur <= note.cursor) {
          note.setcursor = mapcur;
        } else {
          note.setcursor = note.cursor;
        }
      } else {
        note.setcursor = mapcur + 20;
      }
      printf("\r\n------------------ note.cursor = %d ----------------------------\r\n ", note.cursor);

