johnR46/BellLab_STM32/V5/ADC+DMA/USER/main.c
      printf("\r\n------------------ note.setcursor = %d ----------------------------\r\n ", note.setcursor);

    }

    if ((bufferKey3digit[0] || bufferKey3digit[1] || bufferKey3digit[2])) { //  check null spcebar delete
      for ( i = 0; i < 255; i++) {
        if (bufferKey3digit[1] == 0x04 && seeCur != 1) {
          note.state = 0; // left
          printf("\r\nLeft\r\n");
          notepad(0, '\0', 3);
         // note.setcursor = strlen(note.str_ram); //  shift = 20
          note.cursor = strlen(note.str_ram) - 1;
          break;

        } else if (bufferKey3digit[1] == 0x08) {
          printf("\r\nRight\r\n");
          note.state = 1; // right
          notepad(0, '\0', 4);
    //     note.setcursor = strlen(note.str_ram); //  shift = 20
          note.cursor = strlen(note.str_ram) - 1;

          break;
        }
        else if (bufferKey3digit[0] == 0x40) {
          printf("\r\n -- all str --\r\n");
          printf("\r\n %s \r\n",note.str_rom);
          break;
        }


        if (keyCode != 70 && bufferKey3digit[1] == 0 && bufferKey3digit[2] == 0 && bufferKey3digit[0]  == unicodeTable[(char) i] || keyCode == 32) {
          if (seeCur != 1) {
              note.ch = i;

            if (keyCode == 32) {
              note.keycode = 1;
              note.ch = keyCode;

            }
            else if (keyCode == 80) {
              note.keycode = 2;
              note.ch = '\0';

            }
            else {
              note.keycode = 1;
            }
            // select shiftpoint for edit & write || delete str and insert to str_rom
            if (note.shiftpoint >= strlen(note.str_rom) / 20 ) { // endRigjt
               notepad(note.setcursor, note.ch, note.keycode); // send to notepad
               if (note.cursor == 40) {
                  Enddisplay();
                  }

            }
            else if (note.shiftpoint > 1) { // middle  1 <-> max-1

              note.cursor_rom = note.shiftpoint * note.cursor;
              if (note.cursor <= 18) {
                notepad(note.setcursor, note.ch, note.keycode);
                insertsetString(note.str_rom, note.str_ram,note.cursor_rom);
                // insert_rom(note.str_rom,note.ch,note.setcursor);


              }
              if (keyCode == 80 && note.cursor >= 19 && note.cursor <= 20) {
                notepad(note.setcursor, '\0', 2);
              } if (note.cursor >= 20) {
                printf("\r\nMax cursor !! plase delete character \r\n");
              }

            }
              


            else   if (note.shiftpoint == 1) { // Endleft  johnnow
             
              
              if (note.cursor <= 18) {
                notepad(note.setcursor, note.ch, note.keycode);
                insertsetString(note.str_rom, note.str_ram, 1);
                // insert_rom(note.str_rom,note.ch,note.setcursor);


              }
              if (keyCode == 80 && note.cursor >= 19 && note.cursor <= 20) {
                notepad(note.setcursor, '\0', 2);
              } if (note.cursor >= 20) {
                printf("\r\nMax cursor !! plase delete character \r\n");
              }



            }


          }

          break;
        }
      }
    }
    note.keycode = 0;
    countKey = 0;
    keyCode = 0;
    seeCur = 0;

  }
}


char *insertsetString(char *str, char *ch, int start) {

  note.buff = str;
  note.buff2 = ch;
  note.i = 0;

  while (1) {
    note.i++;
    note.buff++;
    if (note.i == start) {
      //  printf("%c",*note.buff);
      note.i = 0;
      while (1) {
        *note.buff = *note.buff2;
        note.buff++;
        note.buff2++;

        if (note.i == strlen(note.buff2)) {
          break;
        }

      }
      break;
    }
  }


  //printf("%s",note.str_rom);
}


char *insert_rom(char *str, char ch, int setcur) { // insert mind str
  if (setcur == 0) {
    // str = aaa
    note.buff = &ch; // ch = A
    strcpy(note.strfirst, note.buff); // F = A
    strcpy(note.strlast, str); //  L =  aaa
    strcat(note.strfirst, note.strlast); // F = A + L = aaa = Aaaa
    strcpy(note.str_ram, note.strfirst); // Aaaa
    memset(note.strfirst, 0, strlen(note.strfirst));
    memset(note.strlast, 0, strlen(note.strlast));
  } else {

    note.buff = str;
    note.i = 0;
    memset(note.strfirst, '\0', 20);
    memset(note.strlast, '\0', 20);
    note.buff2 = note.strfirst;
    while (1) {
      *note.buff2  = *note.buff;
      note.i++;
      note.buff++;
      note.buff2++;

      if (note.i == setcur) {
        note.buff2 = note.strlast;
        while (1) {
          *note.buff2 = *note.buff;
          note.buff++;
          note.buff2++;
          if (*note.buff == '\0') {
            break;
          }

        }
        break;

      }


    }

    note.buff = &ch;
    strcat(note.strfirst, note.buff);
    strcat(note.strfirst, note.strlast);
    strcpy(note.str_rom, note.strfirst);





    memset(note.strfirst, 0, strlen(note.strfirst));
    memset(note.strlast, 0, strlen(note.strlast));

    //printf("str F  = %s\n",note.strfirst);
    //printf("str L  = %s\n",note.strlast);


  }



}

void *endrightstring() {
  //  note.j = 0; // endright   start 0 - 20
  note.j = strlen(note.str_rom);
  memset(note.str_ram, 0, strlen(note.str_ram));
  printf("note.j = %d", note.j);
  copynstr(note.str_ram, note.str_rom + strlen(note.str_rom) - 20, 20);
  printf("\r\n-----------------------\r\n");
  printf("End Right : %s", note.str_ram);
  printf("\r\n-----------------------\r\n");

}


void *endleftstring() {

  memset(note.str_ram, '\0', strlen(note.str_ram));
  note.j = 0;
  printf("note.j = %d", note.j);
  copynstr(note.str_ram, note.str_rom + 0, 20);
  printf("\r\n-----------------------\r\n");
  printf("End Left : %s", note.str_ram);
  printf("\r\n-----------------------\r\n");
  // memset(note.str_ram, 0, strlen(note.str_ram));
}

void *midrightstring() {
  memset(note.str_ram, 0, strlen(note.str_ram));
  note.shiftpoint++;
  note.j = note.j + 20;
  copynstr(note.str_ram, note.str_rom + note.j, 20); //  start 20 - next +20 ->>>>>
  printf("note.j = %d", note.j);
  printf("\r\n-----------------------\r\n");
  printf(" Right is shifpoint = %d and str =  %s", note.shiftpoint, note.str_ram);
  printf("\r\n-----------------------\r\n");
  //memset(note.str_ram, 0, strlen(note.str_ram));




