johnR46/BellLab_STM32/V5/ADC+DMA/USER/main.c
}
void *midleftstring() {
  memset(note.str_ram, 0, strlen(note.str_ram));
  note.shiftpoint--;

  note.j = note.j - 20;
  printf("note.j = %d", note.j);
  copynstr(note.str_ram, note.str_rom + note.j, 20); //  start 20 - next +20

  printf("\r\n-----------------------\r\n");
  printf(" Left is shifpoint = %d and str =  %s", note.shiftpoint, note.str_ram);
  printf("\r\n-----------------------\r\n");
  //memset(note.str_ram, 0, strlen(note.str_ram));

}
char *copynstr(char *str, char * ch, int size) { // strbuff
  note.buff2 = str;
  note.buff = ch; // copy ch to str
  note.i = 0;
  while (1) {
    *note.buff2 = *note.buff;
    note.buff++;
    note.buff2++;
    note.i++;
    if (note.i == size) {
      break;
    }
  }
}


char *deleteString(char *str, char ch, int setcur) { // delete str is setcur
  //  memset(str + strlen(str) - 1,'\0',1);
  note.buff = str;
  note.i = 0;
  /*    div  strF/index 0 + index(setcur)   strL = /(intdex setcur + strlen(str) */
  while (1) {  // separate str to stfF and strLast
    note.strfirst[note.i]  = *note.buff;  // strf = str index 0 - index setcur
    note.i++;
    note.buff++;
    if (note.i == setcur) {
      note.i = 0;
      while (1) {
        note.strlast[ note.i] = *note.buff;       //
        note.i++;
        note.buff++;
        if ( note.i == setcur + strlen(str)) {
          break;
        }
      }
      break;
    }
  }
  memset(note.strfirst + strlen(note.strfirst) - 1, '\0', 1);
  strcat(note.strfirst, note.strlast);
  strcpy(note.str_ram, note.strfirst);
  memset(note.strfirst, 0, strlen(note.strfirst));
  memset(note.strlast, 0, strlen(note.strlast));
}


char *insertString(char *str, char ch, int setcur) {
  // char *buff; // buffer  = index *buffer = value
  if (setcur == 0) { // insert First str
    // str = aaa
    note.buff = &ch; // ch = A
    strcpy(note.strfirst, note.buff); // F = A
    strcpy(note.strlast, str); //  L =  aaa
    strcat(note.strfirst, note.strlast); // F = A + L = aaa = Aaaa
    strcpy(note.str_ram, note.strfirst); // Aaaa
    memset(note.strfirst, 0, strlen(note.strfirst));
    memset(note.strlast, 0, strlen(note.strlast));
  }
  else {
    note.buff = str;
    note.i = 0;
    /*    div  strF/index 0 + index(setcur)   strL = /(intdex setcur + strlen(str) */
    while (1) {  // separate str to stfF and strLast
      note.strfirst[note.i]  = *note.buff;  // strf = str index 0 - index setcur
      note.i++;
      note.buff++;
      if (note.i == setcur) {
        note.i = 0;
        while (1) {
          note.strlast[ note.i] = *note.buff;       //
          note.i++;
          note.buff++;
          if ( note.i == setcur + strlen(str)) {
            break;
          }
        }
        break;
      }
    }

    note.buff = &ch;
    strcat(note.strfirst, note.buff);
    strcat(note.strfirst, note.strlast);
    strcpy(note.str_ram, note.strfirst);
    memset(note.strfirst, 0, strlen(note.strfirst));
    memset(note.strlast, 0, strlen(note.strlast));

  }
}

void *addstring(char ch, int index) { // case 1 add right string
  //  add string in left to right
  note.str_ram[index] = ch;
  note.cursor++;
  note.setcursor++;
  

}
void *addstring2(char ch, int index) { // case 1.2 add middle string
  insertString(note.str_ram, ch, index);
  note.cursor++;
  note.setcursor++;
  if (note.setcursor >=  note.cursor) {
    note.setcursor = note.cursor;
  }
 

}

void *delstring(char ch, int index) { // case 2  delete right to left
  note.str_ram[index] = ch;
  note.cursor--;
  note.setcursor--;
  
}
void *delstring2(char ch, int index) { // case 2.1  delete middle to left string
  deleteString(note.str_ram, ch, index);
  note.cursor--;
  note.setcursor--;
  if (note.setcursor >=  note.cursor) {
    note.setcursor = note.cursor;
  }
 
}


void *Enddisplay() {
  strcat(note.str_rom, note.str_ram); // move string str_ram to str_rom
  note.cursor = 0; // clear cursor
  note.setcursor = 0;
  note.shiftpoint = strlen(note.str_rom) / 20;      // shifpoint =  str/20
  note.j = strlen(note.str_rom);  //  reset shiftLeftstr
  memset(note.str_ram, '\0', strlen(note.str_ram)); // clear str_ram

}

void notepad(int setcursor, char str, int keycode) {
  switch (keycode) {
    //  case 1 add string is Left to Right
    case 1 :
      if (setcursor >= note.cursor) {
        addstring(str,note.cursor);
        printf("\r\n - - - cursor : %d - - - \r\n",note.cursor);
      //  printf("\r\n - - - setcursor : %d - - - \r\n",note.setcursor);
        
        printf("%s",note.str_ram);
			
      }
      else if (setcursor <note.cursor) { // insert string befor lastcursor  by setcursor
            addstring2(str,setcursor);
          	printf("\r\n - - - cursor : %d - - - \r\n",note.cursor);
          //  printf("\r\n - - - setcursor : %d - - - \r\n",note.setcursor);
            printf("%s",note.str_ram);
      }
      break;  // end case 1
    case 2 :
      if (setcursor >= note.cursor && note.cursor > 0 ) { // delete string in right to left
        delstring(str,note.cursor);
      	printf("\r\n - - - cursor : %d - - - \r\n",note.cursor);
        printf("%s",note.str_ram);
      }
      else if (setcursor < note.cursor && note.cursor > 0  ) { // insert string befor lastcursor  by setcursor
          delstring2(str,setcursor);
        	printf("\r\n - - - cursor : %d - - - \r\n",note.cursor);  
          printf("%s",note.str_ram);
      }

      break;
    case 3:   // shift Left
      if (note.shiftpoint == 0) {
        printf("\r\n-----------------------\r\n");
        printf("str_rom  < 20");
        printf("\r\n-----------------------\r\n");
      }
      if (note.shiftpoint == 1) { // End Left   EndLeft = 1 << str_rom >> EndRight  = strlen(str_rom)

        endleftstring();


      }
      if (note.shiftpoint > 1) {
        midleftstring();
      }
      break;

    case 4:   // shift  Right

      if (note.shiftpoint == 0) {

        printf("\r\n-----------------------\r\n");
        printf("str_rom  < 20");
        printf("\r\n-----------------------\r\n");

