johnR46/BellLab_STM32/V5/ADC+DMA/USER/main.c
    }

    printf("current mode:%d\r\n", mode);
    //printf("%d\r\n",sizeof(mode_1)/sizeof(int));
    //////////////////////////////////menu selector ///////////////////////////////////
    if (bufferKey3digit[1] != 0 || bufferKey3digit[2] != 0) { //joy menu
      // ---------------------------- to key code -----------------------------
      if (bufferKey3digit[2] == 1 || bufferKey3digit[2] == 0x20) { // joy is down
        keyCode = 40; // arrow down
        // command_++;
      }
      else if (bufferKey3digit[1] == 1 || bufferKey3digit[1] == 3 || bufferKey3digit[1] == 2) { // joy is up
        keyCode = 55;  // arrow up
      }
      else if (bufferKey3digit[1] == 128 || bufferKey3digit[2] == 0x10) { // joy is up
        keyCode = 38;  //
        //  command_=8;
      }
      else if (bufferKey3digit[1] == 64 || bufferKey3digit[2] == 8) {
        keyCode = 13; // enter
      }
      else if (bufferKey3digit[1] == 32 || bufferKey3digit[2] == 4) {
        keyCode = 8; // backspace
        ///command_ = 99;
      }
      else if (bufferKey3digit[1] == 4 ) {
        keyCode = 38; // left
        //  command_ = 97;
        //command_ = 95; //before delete
      }
      else if (bufferKey3digit[1] == 8) {
        keyCode = 40; // right
        // command_ = 98;
      }
      if (bufferKey3digit[0] == 0x9f) {
        printf("new Folder\r\n");
      }
    }

    //---------------------------------end joy event--------------------------------
    ////////////////////////////////////////////////////////////////////////////////
    //                                                                            //
    //                                                                            //
    //------------------------------- mode selector --------------------------------
    //                                                                            //
    //                                                                            //
    ////////////////////////////////////////////////////////////////////////////////
    //------------------------------- mode (1) -------------------------------------
    if (count_menu >= 1 && count_menu <= maxMenu && mode == 0) { //select menu //modemenu
      if (keyCode == 40) { //up
        if (count_menu != maxMenu) {
          count_menu++;
        }
      }
      else if (keyCode == 38) { //down
        if (count_menu != 1) {
          count_menu -= 1;
        }
      }
    }
    // --------------------------- end mode (1) -----------------------------
    if (count_menu >= 1 && count_menu <= maxMenu && mode == 1) {

    }
    // ----------------------------- mode (5) -------------------------------
    if (count_menu >= 1 && count_menu <= maxMenu && mode == 5) {
      printf("bluetooth Mode\r\n");
    }
    // ----------------------------- end mode (5) ---------------------------
    if (keyCode == 8) { // enter mode && previousMode != mode
      if (mode == 2 && openFileStatus == 1) { // when back form read file
        command_ = 0;
        seaching = 1;
        openFileStatus = 0;
        readstatus = 0;
        endReadFile = 0;
        //--clearf
        addressWriteFlashTemp = 0;
        varForLoop = 0;
        pointer22char = 0;
        //  NextFile = 0;
        countdataTemp512 = 0;
        addressSector = 0;
        countSector4096 = 0;
        countSector512 = 0;
        strLength = 0;

        printf("aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa");
      } else if (mode == 2) { // when back from seach file
        command_ = 0;
        seaching = 0;
        mode = 0;
        printf("bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb");

      }
      else {
        mode = 0;
        GPIO_ResetBits(GPIOC , GPIO_Pin_0); //resetbt
      }
      printf("back seaching = %d openFileStatus = %d\r\n", command_, openFileStatus);
    } // back
    if (keyCode == 13) { //enter
      //  previousMode
      if (mode == 0) { //on menu
        previousMode = mode;
        mode = count_menu;
        printf("enter mode(%d)\r\n", count_menu);
        if (mode == 2) {
          seaching = 1;
          countMenuInReadMode = 0;
        } else if (mode == 1) {
          stringToUnicodeAndSendToDisplay(str2);
        }
      }
      else if (mode == 2 && endReadFile != 1) { //openf
        if (strstr(filelist[countMenuInReadMode - 1], "TBT") == NULL) { //open dir
          openDirStatus = 1;
          //---
          command_ = 0;
          seaching = 1;
          mode = 3;
          openFileStatus = 0;
          //countMenuInReadMode = 0;
          //---
          while (openDirStatus == 1) {
            OpenDir();
          }
        }
        else // open tbt file
        {
          strcpy(prepareNameToOpen, filelist[countMenuInReadMode - 1]);
          printf("Open %s\r\n", prepareNameToOpen);
          i = 0;
          setFileNameLength = 5;
          while (prepareNameToOpen[i] != '\0') {
            setFileNameLength++;
            setFileName[i + 5] = (int)prepareNameToOpen[i];
            printf("- %x ", setFileName[i + 5]);
            i++;
          }
          setFileNameLength++;
          setFileName[i + 5] = 0x00;
          i = 0;
          seaching = 0;
          printf("clrear seaching = 0\r\n");
          openFileStatus = 1;
          readstatus = 1;
        }
      }
    }

    /////////////////////////////// --- end mode --- ////////////////////////////////
    printf("%d\r\n", count_menu); //mode menu
    // -----------------------  visible menu with braille display ---- Mode (1) -----
    switch (mode) { //in list menu mode
      case 0:
        caseMenu(count_menu);
        break;
      case 2: //mode 3 read mode

        if (endReadFile != 1) { //select files
          if (keyCode == 38) { //up
            if (countMenuInReadMode > 1) {
              countMenuInReadMode -= 1;
            }
          } else if (keyCode == 40) { //down
            if (countMenuInReadMode != r_count) {
              countMenuInReadMode += 1;
            }
          }
          if (countMenuInReadMode == 0) { //select file
            stringToUnicodeAndSendToDisplay("Read mode");
            printf("******print (Read mode) to dot *********\r\n");
          } else {
            stringToUnicodeAndSendToDisplay(filelist[countMenuInReadMode - 1]);
            printf("******print (%s) to dot ********\r\n", filelist[countMenuInReadMode - 1]);
          }   //prepareNameToOpen
        } else {
          if (keyCode == 38 || keyCode == 40 && endReadFile == 1) { //readfg
            if (keyCode == 40) { //next line
              pointer22char += NextPoint - pointer22char;
              if (pointer22char + 22 > 4096 && pointer22char + 22 < addressWriteFlashTemp) { // sector more than (one)
                pointerSectorStatus = 1;
                printf("change sector\r\n");
              }
              if (pointer22char + 22 < addressWriteFlashTemp)
                maxLengthLoopL22 = 22;
              else
                maxLengthLoopL22 = addressWriteFlashTemp - pointer22char; //last value
            } else if (keyCode == 38) { //prev line pointer22char   bug***
              printf("\r\n \r\n pointer22char %d \r\n \r\n", pointer22char);
              //NextPoint
              TempPointer22char = pointer22char;
              for (varForLoop = TempPointer22char; varForLoop > 0; varForLoop--) { // edit condition > 0 ->   ??? > 1*pointerSector
                countLengthInLine++;
                if (SST25_buffer99[varForLoop] == 0x0d) { //
                  countLFTwoStep++;
                  if (countLengthInLine == 5 && countLFTwoStep == 2) {
                    pointer22char = varForLoop;
                    countLFTwoStep = 0;
                    printf("Length:--%d--\r\n", countLengthInLine);
                    break;
                  }
                  if (countLFTwoStep == 2) { //check 0x0d 0x0a two event
                    pointer22char = varForLoop + 2;
                    countLFTwoStep = 0;
                    printf("Length:--%d--\r\n", countLengthInLine);
                    break;
                  }
                } else if (varForLoop == 1) { //begin of file
                  pointer22char = 0;
                  // -- find max length --

                  //-- end find mx length --
                  if (pointerSector != 0) { //if sector != 1
                    readPreviousSector = 1; //status for read previous sector
                    printf("reading prevois sector -----------------------------\r\n");
                  }
                }
                if (pointer22char + 22 < addressWriteFlashTemp)
                  maxLengthLoopL22 = 22;
                else
                  maxLengthLoopL22 = addressWriteFlashTemp - pointer22char; //last value
                /// printf("%c=",SST25_buffer99[j]);
              }
              countLengthInLine = 0; //clear
            } //--------------------------end 38------------------------
            for (NextPoint = pointer22char; NextPoint < (pointer22char + maxLengthLoopL22); NextPoint++) { //query line
              if (NextPoint + (pointerSector * 4096) < addressWriteFlashTemp) {
                if (SST25_buffer99[NextPoint] == 0x0d) { //next value-> 0x0a
                  jumpLECR = pointer22char + 20 - NextPoint; //store index value whene amount string less than 20
                  NextPoint += 2;
                  break;
                }
                //NextLenghtLess20
                buffer22Char[NextPoint - pointer22char] = SST25_buffer99[NextPoint];
                printf("%c/", SST25_buffer99[NextPoint]);
              } else {
                break;
              }
            }
            for (i = 20 - jumpLECR; i < 20; i++) { //clear another character
              buffer22Char[i] = 0;
            }
            if (readPreviousSector == 1) { //read previous sector when keycode == 38 && sector != 0
              readPreviousSector = 0;
              pointerSector--;
              configFlash();
              SPI_FLASH_CS_LOW();
              SST25_R_BLOCK(pointerSector * 4096, SST25_buffer99, 4096);
              SPI_FLASH_CS_HIGH();
              Delay(0xffff);
              pointer22char = 4096;
            }
            //check string buffer before push to display when < less than 20 charactor
            stringToUnicodeAndSendToDisplay(buffer22Char);
            printf("//sector: %d //send: %d-- %s -\r\n", pointerSector, pointer22char, buffer22Char);
            if (pointerSectorStatus == 1) { //read next sector
              pointerSectorStatus = 0;
              pointerSector++;
              pointer22char = 0;
              NextPoint = 0;
              //printf("seeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee\r\n");
              // print last string again
              configFlash();
              SPI_FLASH_CS_LOW();
              SST25_R_BLOCK(pointerSector * 4096, SST25_buffer99, 4096);
              SPI_FLASH_CS_HIGH();
              Delay(0xffff);
              stringToUnicodeAndSendToDisplay(buffer22Char); // print againt
              //delay_ms(1000);
            }
          }
        }
        break;
      case 3:
        stringToUnicodeAndSendToDisplay("STM Braille SLRI");
        break;
    }
    //------------------------------ end case menu ------------------------
    countKey = 0;
    keyCode = 0;
    seeCur = 0;
  }
}
void caseMenu(int count_menu) {
  switch (count_menu) {
    case 1:
      printDot(st_notepad, sizeof(st_notepad));
      break;
    case 2:
      printDot(st_read, sizeof(st_read));
      break;
    case 3:
      printDot(st_bluetooth, sizeof(st_bluetooth));
      break;
      /*case 1:
        printDot(st_notepad, sizeof(st_notepad));
        break;
        case 2:
        printDot(st_filemanage, sizeof(st_filemanage));
        break;
        case 3:
        printDot(st_read, sizeof(st_read));
        break;
        case 4:
        printDot(st_usbconnect, sizeof(st_usbconnect));
        break;
        case 5:
        printDot(st_bluetooth, sizeof(st_bluetooth));
        break;
        case 6:
        printDot(st_clock, sizeof(st_clock));
        break;
        case 7:
        printDot(st_calcu, sizeof(st_calcu));
        break;
        case 8:
        printDot(st_tools, sizeof(st_tools));
        break;*/
  }
}

void printDot(int data[], int size) {
  int tsize = size / sizeof(int);
  //  printf("%d", sizeof(testarray[0]) / sizeof(int));
  clearDot();
  SPI_DISPLAY_CS_LOW();
  Delay(0x55F);
  for (j = 20; j >= 0; j--) {
    if (j < tsize)
      cell_sentdata(~data[j]);
    else
      cell_sentdata(0xff); // null dot
  }
  SPI_DISPLAY_CS_HIGH();
  Delay(0x55F);

